cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing
#+TAGS: GF(g)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Ultra Juicy Grilled BBQ Pork Chops
:PROPERTIES:
:export_file_name: ultra-juicy-grilled-bbq-pork-chops
:export_hugo_custom_front_matter: :servings 6
:export_hugo_custom_front_matter+: :prep-time 10
:export_hugo_custom_front_matter+: :cook-time 20
:export_hugo_custom_front_matter+: :ready-in 30
:source-url: https://www.lecremedelacrumb.com/ultra-juicy-grilled-bbq-pork-chops/
:END:

*** Ingredients

- 4-6 thick-cut boneless pork chops
- salt and pepper
- 1 cup ketchup
- 2/3 cup brown sugar - packed
  - Try half this amount for a healther sauce. Still delicious
- 3 tablespoons worcestershire sauce
- 3 tablespoons apple cider vinegar
- 2 tablespoons dijon mustard
- 1 teaspoon mesquite seasoning  -  see note
- 1/2 teaspoon garlic powder
- 1/2 teaspoon salt
- 1/4 teaspoon cracked black pepper  -  if using ground pepper, reduce to 1/8 teaspoon

*** Directions

1. In a medium sauce pan over medium heat, combine all ingredients for the bbq sauce. Bring to a boil, reduce to low and simmer for 5 minutes, stirring throughout. Reduce from heat and set aside.
2. Preheat grill to medium and oil the grates.
3. Season pork chops generously with salt and pepper on both sides.
4. Place pork chops on the grill, cook for 2-3 minutes, then turn over and brush bbq sauce all over the tops and sides of the pork chops. Cook another 5-7 minutes, then turn and brush bbq sauce all over the tops and sides again.
5. Cook 5-7 minutes longer until internal temperature reaches 140 degrees F or there is no longer any pink in the center. Allow to rest on a plate or cutting board – covered – for at least 5 minutes before serving – this is KEY to keeping the pork chops nice and juicy.
6. Serve with remaining bbq sauce. Enjoy!

